Revit.GeometryConversion.GeometryObjectConverter.ConvertToMany(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Reference,Autodesk.DesignScript.Geometry.CoordinateSystem)
Get the edges and faces from the solid and convert them
solid:
reference:
transform:
Returns: